lyq11/ESP32-Garage-Door-Control/firmware/c3_garage_node/c3_garage_node.ino
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <WebServer.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_task_wdt.h>
#include <freertos/queue.h>

static const char *HOSTNAME = "garage-c3";
static const char *SETUP_AP_SSID = "garage-c3-setup";
static const char *SETUP_AP_PASSWORD = "12345678";
static const int RELAY_PIN = 10;
static const bool RELAY_ACTIVE_LEVEL = HIGH;
static const uint32_t DEFAULT_PULSE_MS = 700;
static const uint8_t DEFAULT_ESPNOW_CHANNEL = 11;
static const uint32_t COMMAND_COOLDOWN_MS = 5000;
static const uint32_t WIFI_RECONNECT_INTERVAL_MS = 10000;
static const uint32_t WIFI_AP_FALLBACK_MS = 60000;
static const uint32_t GARAGE_MAGIC = 0x47415231; // GAR1
static const uint8_t GARAGE_CMD_TRIGGER = 1;
static const char *AUTH_USER = "admin";
static const char *DEFAULT_ADMIN_PASSWORD = "12345678";

void logLine(const String &message) {
  Serial.print("[");
  Serial.print(millis());
  Serial.print("][GARAGE-C3] ");
  Serial.println(message);
}

struct GarageCommandPacket {
  uint32_t magic;
  uint8_t version;
  uint8_t command;
  uint16_t userId;
  uint32_t seq;
  uint32_t millisStamp;
  uint32_t signature;
};

struct GarageAckPacket {
  uint32_t magic;
  uint32_t seq;
  uint8_t ok;
  uint8_t state;
};

struct PendingGarageCommand {
  uint8_t mac[6];
  int len;
  GarageCommandPacket packet;
};

static_assert(sizeof(GarageCommandPacket) == 20, "Unexpected command packet size");
static_assert(sizeof(GarageAckPacket) == 12, "Unexpected ack packet size");

uint32_t packetSignature(const GarageCommandPacket &packet);
bool handleGarageCommand(const uint8_t *mac, const GarageCommandPacket &packet);

Preferences preferences;
WebServer server(80);
QueueHandle_t garageCommandQueue = nullptr;

bool wifiReady = false;
bool setupApRunning = false;
bool espNowReady = false;
bool relayActive = false;
bool commandEnabled = true;
uint32_t relayPulseMs = DEFAULT_PULSE_MS;
uint8_t espNowChannel = DEFAULT_ESPNOW_CHANNEL;
uint8_t fallbackChannel = DEFAULT_ESPNOW_CHANNEL;
String s3BaseUrl;
uint32_t relayPulseStartMs = 0;
uint32_t lastCommandMs = 0;
uint32_t lastSeq = 0;
uint32_t acceptedCount = 0;
uint32_t rejectedCount = 0;
uint32_t lastRxMs = 0;
uint32_t lastAckMs = 0;
bool lastAckSendOk = false;
int lastAckSendErr = 0;
uint16_t lastUserId = 0xFFFF;
String lastRejectReason;
String lastCommandSource;
String sharedSecret = "garage-secret";
String allowedS3MacText;
uint8_t allowedS3Mac[6] = {0};
bool allowedS3MacConfigured = false;
String savedSsid;
String savedPass;
String adminPassword = DEFAULT_ADMIN_PASSWORD;
uint32_t lastWifiCheckMs = 0;
uint32_t lastWifiReconnectMs = 0;
uint32_t wifiReconnectCount = 0;
uint32_t wifiDisconnectedSinceMs = 0;
uint32_t espNowQueueDrops = 0;
wl_status_t lastWifiStatus = WL_IDLE_STATUS;

uint32_t fnv1a(const uint8_t *data, size_t len, uint32_t hash = 2166136261UL) {
  for (size_t i = 0; i < len; i++) {
    hash ^= data[i];
    hash *= 16777619UL;
  }
  return hash;
}

uint32_t packetSignature(const GarageCommandPacket &packet) {
  uint32_t hash = fnv1a((const uint8_t *)sharedSecret.c_str(), sharedSecret.length());
  hash = fnv1a((const uint8_t *)&packet.magic, sizeof(packet.magic), hash);
  hash = fnv1a((const uint8_t *)&packet.version, sizeof(packet.version), hash);
  hash = fnv1a((const uint8_t *)&packet.command, sizeof(packet.command), hash);
  hash = fnv1a((const uint8_t *)&packet.userId, sizeof(packet.userId), hash);
  hash = fnv1a((const uint8_t *)&packet.seq, sizeof(packet.seq), hash);
  hash = fnv1a((const uint8_t *)&packet.millisStamp, sizeof(packet.millisStamp), hash);
  return hash;
}

bool parseMac(const String &text, uint8_t out[6]) {
  int values[6];
  if (sscanf(text.c_str(), "%x:%x:%x:%x:%x:%x",
             &values[0], &values[1], &values[2], &values[3], &values[4], &values[5]) != 6) {
    return false;
  }
  for (uint8_t i = 0; i < 6; i++) {
    if (values[i] < 0 || values[i] > 255) return false;
    out[i] = (uint8_t)values[i];
  }
  return true;
}

String macToString(const uint8_t mac[6]) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

String jsonEscape(const String &value) {
  String out;
  for (size_t i = 0; i < value.length(); i++) {
    char c = value[i];
    if (c == '"' || c == '\\') {
      out += '\\';
      out += c;
    } else if (c == '\n') {
      out += "\\n";
    } else if (c == '\r') {
      out += "\\r";
    } else {
      out += c;
    }
  }
  return out;
}

String htmlEscape(const String &value) {
  String out;
  out.reserve(value.length() + 8);
  for (size_t i = 0; i < value.length(); i++) {
    switch (value[i]) {
      case '&': out += F("&amp;"); break;
      case '<': out += F("&lt;"); break;
      case '>': out += F("&gt;"); break;
      case '"': out += F("&quot;"); break;
      case '\'': out += F("&#39;"); break;
      default: out += value[i]; break;
    }
  }
  return out;
}

void relayOff() {
  digitalWrite(RELAY_PIN, !RELAY_ACTIVE_LEVEL);
  relayActive = false;
  logLine("relay off");
}

void startRelayPulse() {
  digitalWrite(RELAY_PIN, RELAY_ACTIVE_LEVEL);
  relayPulseStartMs = millis();
  relayActive = true;
  logLine("relay pulse start pulseMs=" + String(relayPulseMs));
}

bool macAllowed(const uint8_t *mac) {
  if (!allowedS3MacConfigured) return true;
  return memcmp(mac, allowedS3Mac, 6) == 0;
}

void sendAck(const uint8_t *mac, uint32_t seq, bool ok, uint8_t state) {
  if (!esp_now_is_peer_exist(mac)) {
    esp_now_peer_info_t peerInfo = {};
    memcpy(peerInfo.peer_addr, mac, 6);
    peerInfo.channel = WiFi.channel();
    peerInfo.encrypt = false;
    esp_now_add_peer(&peerInfo);
  }
  GarageAckPacket ack = {};
  ack.magic = GARAGE_MAGIC;
  ack.seq = seq;
  ack.ok = ok ? 1 : 0;
  ack.state = state;
  esp_err_t err = esp_now_send(mac, (const uint8_t *)&ack, sizeof(ack));
  lastAckSendOk = err == ESP_OK;
  lastAckSendErr = (int)err;
  lastAckMs = millis();
  logLine("ack seq=" + String(seq) +
          " ok=" + String(ok ? "true" : "false") +
          " sendOk=" + String(lastAckSendOk ? "true" : "false") +
          " err=" + String(lastAckSendErr));
}

