lyq11/ESP32-Garage-Door-Control/firmware/c3_garage_node/c3_garage_node.ino
bool handleGarageCommand(const uint8_t *mac, const GarageCommandPacket &packet) {
  lastRxMs = millis();
  lastCommandSource = macToString(mac);

  if (!commandEnabled) {
    lastRejectReason = "disabled";
    logLine("reject command: disabled");
    return false;
  }
  if (!macAllowed(mac)) {
    lastRejectReason = "source_mac_not_allowed";
    logLine("reject command: source mac not allowed " + macToString(mac));
    return false;
  }
  if (packet.magic != GARAGE_MAGIC || packet.version != 1) {
    lastRejectReason = "bad_magic_or_version";
    logLine("reject command: bad magic/version");
    return false;
  }
  if (packet.command != GARAGE_CMD_TRIGGER) {
    lastRejectReason = "bad_command";
    logLine("reject command: bad command");
    return false;
  }
  if (packet.signature != packetSignature(packet)) {
    lastRejectReason = "bad_signature";
    logLine("reject command: bad signature");
    return false;
  }
  if (packet.seq <= lastSeq) {
    lastRejectReason = "replay_or_old_seq";
    logLine("reject command: replay seq=" + String(packet.seq));
    return false;
  }
  if (lastCommandMs != 0 && millis() - lastCommandMs < COMMAND_COOLDOWN_MS) {
    lastRejectReason = "cooldown";
    logLine("reject command: cooldown");
    return false;
  }

  lastSeq = packet.seq;
  persistLastSeq();
  lastCommandMs = millis();
  lastUserId = packet.userId;
  lastRejectReason = "";
  acceptedCount++;
  logLine("accept command seq=" + String(packet.seq) +
          " userId=" + String(packet.userId) +
          " from=" + lastCommandSource);
  startRelayPulse();
  return true;
}

#if ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  const uint8_t *mac = info->src_addr;
#else
void onEspNowRecv(const uint8_t *mac, const uint8_t *data, int len) {
#endif
  if (!garageCommandQueue) {
    __atomic_fetch_add(&espNowQueueDrops, 1, __ATOMIC_RELAXED);
    return;
  }
  PendingGarageCommand pending = {};
  memcpy(pending.mac, mac, sizeof(pending.mac));
  pending.len = len;
  if (len == sizeof(GarageCommandPacket)) {
    memcpy(&pending.packet, data, sizeof(pending.packet));
  }
  if (xQueueSend(garageCommandQueue, &pending, 0) != pdTRUE) {
    __atomic_fetch_add(&espNowQueueDrops, 1, __ATOMIC_RELAXED);
  }
}

void processEspNowQueue() {
  if (!garageCommandQueue) return;
  PendingGarageCommand pending;
  while (xQueueReceive(garageCommandQueue, &pending, 0) == pdTRUE) {
    if (pending.len != sizeof(GarageCommandPacket)) {
      rejectedCount++;
      lastRejectReason = "bad_packet_size";
      logLine("reject command: bad packet size=" + String(pending.len));
      continue;
    }
    bool ok = handleGarageCommand(pending.mac, pending.packet);
    if (!ok) rejectedCount++;
    sendAck(pending.mac, pending.packet.seq, ok, relayActive ? 1 : 0);
  }
}

void beginEspNow() {
  if (!garageCommandQueue) {
    garageCommandQueue = xQueueCreate(8, sizeof(PendingGarageCommand));
    if (!garageCommandQueue) {
      logLine("esp-now queue allocation failed");
      espNowReady = false;
      return;
    }
  }
  if (espNowReady) {
    esp_now_deinit();
    espNowReady = false;
  }
  if (esp_now_init() != ESP_OK) {
    espNowReady = false;
    logLine("esp-now init failed");
    return;
  }
  espNowReady = true;
  esp_now_register_recv_cb(onEspNowRecv);
  logLine("esp-now ready channel=" + String(WiFi.channel()));
}

void loadConfig() {
  preferences.begin("cfg", true);
  commandEnabled = preferences.getBool("enabled", true);
  relayPulseMs = preferences.getUInt("pulseMs", DEFAULT_PULSE_MS);
  fallbackChannel = preferences.getUChar("channel", DEFAULT_ESPNOW_CHANNEL);
  sharedSecret = preferences.getString("secret", "garage-secret");
  allowedS3MacText = preferences.getString("s3mac", "");
  s3BaseUrl = preferences.getString("s3url", "");
  adminPassword = preferences.getString("adminPass", DEFAULT_ADMIN_PASSWORD);
  lastSeq = preferences.getUInt("lastSeq", 0);
  preferences.end();
  if (!adminPassword.length()) {
    adminPassword = DEFAULT_ADMIN_PASSWORD;
  }
  allowedS3MacConfigured = parseMac(allowedS3MacText, allowedS3Mac);
  if (relayPulseMs < 100 || relayPulseMs > 5000) {
    relayPulseMs = DEFAULT_PULSE_MS;
  }
  if (fallbackChannel < 1 || fallbackChannel > 13) {
    fallbackChannel = DEFAULT_ESPNOW_CHANNEL;
  }
  espNowChannel = fallbackChannel;
  logLine("config enabled=" + String(commandEnabled ? "true" : "false") +
          " pulseMs=" + String(relayPulseMs) +
          " fallbackChannel=" + String(fallbackChannel) +
          " lastSeq=" + String(lastSeq) +
          " s3url=" + s3BaseUrl +
          " s3mac=" + allowedS3MacText);
}

void persistLastSeq() {
  preferences.begin("cfg", false);
  preferences.putUInt("lastSeq", lastSeq);
  preferences.end();
}

void clearLastSeq(const String &reason) {
  preferences.begin("cfg", false);
  preferences.remove("lastSeq");
  preferences.end();
  lastSeq = 0;
  logLine("esp-now replay sequence cleared reason=" + reason);
}

void saveConfig(bool enabled, uint32_t pulseMs, uint8_t channel, const String &secret,
                 const String &s3mac, const String &s3url) {
  String oldMac = allowedS3MacText;
  String newMac = s3mac;
  oldMac.trim();
  newMac.trim();
  uint8_t parsedMac[6];
  if (parseMac(oldMac, parsedMac)) oldMac = macToString(parsedMac);
  if (parseMac(newMac, parsedMac)) newMac = macToString(parsedMac);
  bool sourceMacChanged = !oldMac.equalsIgnoreCase(newMac);

  preferences.begin("cfg", false);
  preferences.putBool("enabled", enabled);
  preferences.putUInt("pulseMs", pulseMs);
  preferences.putUChar("channel", channel);
  preferences.putString("secret", secret);
  preferences.putString("s3mac", newMac);
  preferences.putString("s3url", s3url);
  if (sourceMacChanged) {
    preferences.remove("lastSeq");
  }
  preferences.end();
  loadConfig();
  if (sourceMacChanged) {
    logLine("S3 MAC changed; replay sequence reset");
  }
}

void saveAdminPassword(const String &password) {
  String next = password;
  next.trim();
  if (!next.length()) {
    return;
  }
  preferences.begin("cfg", false);
  preferences.putString("adminPass", next);
  preferences.end();
  adminPassword = next;
}

int fetchS3Channel() {
  if (WiFi.status() != WL_CONNECTED || !s3BaseUrl.length()) {
    return -1;
  }
  String url = s3BaseUrl;
  url.trim();
  while (url.endsWith("/")) {
    url.remove(url.length() - 1);
  }
  url += "/api/garage/status";

  HTTPClient http;
  http.setConnectTimeout(2500);
  http.setTimeout(2500);
  if (!http.begin(url)) {
    logLine("s3 channel query begin failed");
    return -1;
  }
  int code = http.GET();
  String body = http.getString();
  http.end();
  if (code != 200) {
    logLine("s3 channel query http=" + String(code));
    return -1;
  }
  int pos = body.indexOf("\"channel\":");
  if (pos < 0) {
    return -1;
  }
  int start = pos + 10;
  int end = start;
  while (end < body.length() && isDigit(body[end])) {
    end++;
  }
  int channel = body.substring(start, end).toInt();
  if (channel < 1 || channel > 13) {
    return -1;
  }
  return channel;
}

void resolveEspNowChannel() {
  if (WiFi.status() == WL_CONNECTED) {
    espNowChannel = WiFi.channel();
    int s3Channel = fetchS3Channel();
    if (s3Channel > 0 && s3Channel != espNowChannel) {
      logLine("warning: s3 channel=" + String(s3Channel) +
              " local wifi channel=" + String(espNowChannel));
    } else if (s3Channel > 0) {
      logLine("s3 channel confirmed=" + String(s3Channel));
    }
    return;
  }
  espNowChannel = fallbackChannel;
}

void startSetupAp() {
  WiFi.mode(WIFI_AP_STA);
  WiFi.setSleep(false);
  espNowChannel = fallbackChannel;
  WiFi.softAP(SETUP_AP_SSID, SETUP_AP_PASSWORD, espNowChannel);
  setupApRunning = true;
  wifiReady = true;
  logLine("setup AP started ssid=" + String(SETUP_AP_SSID) +
          " ip=" + WiFi.softAPIP().toString() +
          " channel=" + String(WiFi.channel()));
  if (espNowReady) {
    beginEspNow();
  }
}

void connectWifiOrStartAp() {
  WiFi.setHostname(HOSTNAME);
  WiFi.persistent(false);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  preferences.begin("wifi", true);
  savedSsid = preferences.getString("ssid", "");
  savedPass = preferences.getString("pass", "");
  preferences.end();
  if (!savedSsid.length()) {
    startSetupAp();
    return;
  }
  WiFi.mode(WIFI_STA);
  WiFi.begin(savedSsid.c_str(), savedPass.c_str());
  uint32_t startMs = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startMs < 15000) {
    delay(300);
  }
  if (WiFi.status() == WL_CONNECTED) {
    wifiReady = true;
    lastWifiStatus = WL_CONNECTED;
    logLine("wifi connected ip=" + WiFi.localIP().toString() +
            " channel=" + String(WiFi.channel()));
  } else {
    logLine("wifi connect failed, starting AP");
    startSetupAp();
  }
}

void maintainWifi() {
  if (!savedSsid.length()) {
    return;
  }
  if (millis() - lastWifiCheckMs < 1000) {
    return;
  }
  lastWifiCheckMs = millis();

  wl_status_t status = WiFi.status();
  if (status == WL_CONNECTED) {
    if (lastWifiStatus != WL_CONNECTED) {
      wifiReady = true;
      wifiDisconnectedSinceMs = 0;
      if (setupApRunning) {
        WiFi.softAPdisconnect(true);
        setupApRunning = false;
        WiFi.mode(WIFI_STA);
      }
      logLine("wifi reconnected ip=" + WiFi.localIP().toString() +
              " channel=" + String(WiFi.channel()) +
              " rssi=" + String(WiFi.RSSI()));
      resolveEspNowChannel();
      beginEspNow();
    }
    lastWifiStatus = status;
    return;
  }

  if (lastWifiStatus == WL_CONNECTED) {
    wifiReady = false;
    wifiDisconnectedSinceMs = millis();
    logLine("wifi disconnected status=" + String((int)status));
  }
  if (wifiDisconnectedSinceMs == 0) {
    wifiDisconnectedSinceMs = millis();
  }
  lastWifiStatus = status;

  if (!setupApRunning && millis() - wifiDisconnectedSinceMs >= WIFI_AP_FALLBACK_MS) {
    logLine("wifi unavailable, enabling setup AP while retries continue");
    startSetupAp();
  }

  if (millis() - lastWifiReconnectMs >= WIFI_RECONNECT_INTERVAL_MS) {
    lastWifiReconnectMs = millis();
    wifiReconnectCount++;
    logLine("wifi reconnect attempt=" + String(wifiReconnectCount) +
            " status=" + String((int)status));
    WiFi.disconnect(false);
    WiFi.begin(savedSsid.c_str(), savedPass.c_str());
  }
}

String bodyArg(const String &key) {
  if (server.hasArg(key)) return server.arg(key);
  return "";
}

