lyq11/ESP32-Garage-Door-Control/firmware/c3_garage_node/c3_garage_node.ino
bool bodyBool(const String &key, bool fallback) {
  String v = bodyArg(key);
  if (!v.length()) return fallback;
  v.toLowerCase();
  return v == "true" || v == "1" || v == "on";
}

int bodyInt(const String &key, int fallback) {
  String v = bodyArg(key);
  return v.length() ? v.toInt() : fallback;
}

void sendJson(int code, const String &json) {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET,POST,OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  server.send(code, "application/json; charset=utf-8", json);
}

bool requireAuth() {
  if (server.authenticate(AUTH_USER, adminPassword.c_str())) {
    return true;
  }
  server.requestAuthentication(BASIC_AUTH, "garage-c3");
  return false;
}

String statusJson() {
  String json = F("{\"ok\":true,\"hostname\":\"");
  json += HOSTNAME;
  json += F("\",\"mac\":\"");
  json += WiFi.macAddress();
  json += F("\",\"ip\":\"");
  json += (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  json += F("\",\"ssid\":\"");
  json += jsonEscape(WiFi.status() == WL_CONNECTED ? WiFi.SSID() : String(SETUP_AP_SSID));
  json += F("\",\"wifiMode\":\"");
  json += setupApRunning ? F("AP") : F("STA");
  json += F("\",\"wifiStatus\":");
  json += (int)WiFi.status();
  json += F(",\"rssi\":");
  json += WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0;
  json += F(",\"reconnectAttempts\":");
  json += wifiReconnectCount;
  json += F(",\"espNowQueueDrops\":");
  json += __atomic_load_n(&espNowQueueDrops, __ATOMIC_RELAXED);
  json += F(",\"channel\":");
  json += WiFi.channel();
  json += F(",\"espNowReady\":");
  json += espNowReady ? F("true") : F("false");
  json += F(",\"commandEnabled\":");
  json += commandEnabled ? F("true") : F("false");
  json += F(",\"relayPin\":");
  json += RELAY_PIN;
  json += F(",\"relayActive\":");
  json += relayActive ? F("true") : F("false");
  json += F(",\"pulseMs\":");
  json += relayPulseMs;
  json += F(",\"espNowChannel\":");
  json += espNowChannel;
  json += F(",\"fallbackChannel\":");
  json += fallbackChannel;
  json += F(",\"acceptedCount\":");
  json += acceptedCount;
  json += F(",\"rejectedCount\":");
  json += rejectedCount;
  json += F(",\"lastSeq\":");
  json += lastSeq;
  json += F(",\"lastUserId\":");
  json += lastUserId;
  json += F(",\"lastRxMs\":");
  json += lastRxMs;
  json += F(",\"lastAckMs\":");
  json += lastAckMs;
  json += F(",\"lastAckSendOk\":");
  json += lastAckSendOk ? F("true") : F("false");
  json += F(",\"lastAckSendErr\":");
  json += lastAckSendErr;
  json += F(",\"lastCommandSource\":\"");
  json += lastCommandSource;
  json += F("\",\"lastRejectReason\":\"");
  json += jsonEscape(lastRejectReason);
  json += F("\",\"allowedS3Mac\":\"");
  json += allowedS3MacText;
  json += F("\",\"s3BaseUrl\":\"");
  json += jsonEscape(s3BaseUrl);
  json += F("\",\"ota\":\"arduino_ota\"}");
  return json;
}

void handleConfig() {
  if (!requireAuth()) return;
  uint32_t pulse = (uint32_t)bodyInt("pulseMs", relayPulseMs);
  pulse = constrain(pulse, 100UL, 5000UL);
  uint8_t channel = (uint8_t)constrain(bodyInt("channel", fallbackChannel), 1, 13);
  String secret = bodyArg("secret");
  if (!secret.length()) secret = sharedSecret;
  String s3mac = bodyArg("s3mac");
  String s3url = bodyArg("s3url");
  if (!s3url.length()) s3url = s3BaseUrl;
  saveConfig(bodyBool("enabled", commandEnabled), pulse, channel, secret, s3mac, s3url);
  sendJson(200, F("{\"ok\":true,\"message\":\"config_saved_rebooting\"}"));
  delay(500);
  ESP.restart();
}

void handleIndex() {
  if (!requireAuth()) return;
  bool connected = WiFi.status() == WL_CONNECTED;
  String displaySsid = connected ? WiFi.SSID() : String(SETUP_AP_SSID) + " (setup AP)";
  int rssi = connected ? WiFi.RSSI() : 0;
  int signalPercent = connected ? constrain(2 * (rssi + 100), 0, 100) : 0;
  const char *signalLabel = !connected ? "Disconnected" :
                            rssi >= -55 ? "Excellent" :
                            rssi >= -67 ? "Good" :
                            rssi >= -75 ? "Fair" : "Weak";
  String html = F("<!doctype html><html><head><meta charset='utf-8'>"
                  "<meta name='viewport' content='width=device-width,initial-scale=1'>"
                  "<title>garage-c3 setup</title>"
                  "<style>*{box-sizing:border-box}body{font-family:Arial,sans-serif;margin:20px;max-width:760px;overflow-wrap:anywhere}"
                  "input,select,button{box-sizing:border-box;width:100%;padding:9px;margin:5px 0 12px}"
                  ".status-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(145px,1fr));gap:10px;margin:12px 0 18px}"
                  ".status-card{background:#eef4f8;border-radius:8px;padding:12px;min-width:0}.status-label{font-size:12px;color:#52606d}.status-value{font-weight:bold;margin-top:5px;word-break:break-word}"
                  "details{margin:12px 0 20px}pre{background:#111;color:#d7f2ff;padding:10px;max-width:100%;white-space:pre-wrap;overflow-wrap:anywhere;word-break:break-all;overflow-x:auto}</style></head><body>");
  html += F("<h1>garage-c3 setup</h1><div class='status-grid'><div class='status-card'><div class='status-label'>WiFi name</div><div class='status-value'>");
  html += htmlEscape(displaySsid);
  html += F("</div></div><div class='status-card'><div class='status-label'>WiFi signal</div><div class='status-value'>");
  html += signalLabel;
  if (connected) {
    html += " · " + String(rssi) + " dBm · " + String(signalPercent) + "%";
  }
  html += F("</div></div><div class='status-card'><div class='status-label'>IP address</div><div class='status-value'>");
  html += connected ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  html += F("</div></div><div class='status-card'><div class='status-label'>ESP-NOW</div><div class='status-value'>");
  html += espNowReady ? F("Ready") : F("Not ready");
  html += F("</div></div></div><details><summary>Device diagnostics</summary><pre>");
  html += htmlEscape(statusJson());
  html += F("</pre></details><h2>WiFi</h2><form method='post' action='/api/wifi/save'>"
            "<label>SSID</label><input name='ssid' value='");
  html += htmlEscape(savedSsid);
  html += F("'>"
            "<label>Password</label><input name='pass' type='password'>"
            "<button type='submit'>Save WiFi and reboot</button></form>"
            "<form method='post' action='/api/wifi/clear'><button type='submit'>Clear WiFi and reboot</button></form>");
  html += F("<h2>Garage</h2><form method='post' action='/api/config'>"
            "<label>Enabled</label><select name='enabled'><option value='true'>true</option><option value='false'>false</option></select>"
            "<label>Pulse ms</label><input name='pulseMs' type='number' min='100' max='5000' value='");
  html += relayPulseMs;
  html += F("'><label>Fallback channel (used when WiFi is not connected)</label><input name='channel' type='number' min='1' max='13' value='");
  html += fallbackChannel;
  html += F("'><label>S3 base URL (optional, for channel check)</label><input name='s3url' value='");
  html += htmlEscape(s3BaseUrl);
  html += F("'><label>S3 MAC whitelist (optional)</label><input name='s3mac' value='");
  html += htmlEscape(allowedS3MacText);
  html += F("'><label>Shared secret</label><input name='secret' value='");
  html += htmlEscape(sharedSecret);
  html += F("'><button type='submit'>Save garage config and reboot</button></form>"
            "<h2>ESP-NOW replay protection</h2><p>Last accepted sequence: <strong>");
  html += lastSeq;
  html += F("</strong></p><form method='post' action='/api/espnow/reset-seq' "
            "onsubmit='return confirm(&quot;Clear the accepted sequence? Only do this when replacing the S3 controller.&quot;)'>"
            "<button type='submit'>Clear old sequence</button></form>"
            "<h2>Admin password</h2><form method='post' action='/api/auth/password'>"
            "<label>New password</label><input name='password' type='password' minlength='6'>"
            "<button type='submit'>Save password</button></form>"
            "<form method='post' action='/api/relay/test'><button type='submit'>Test relay pulse</button></form>"
            "</body></html>");
  server.send(200, "text/html; charset=utf-8", html);
}

void handleRelayTest() {
  if (!requireAuth()) return;
  if (lastCommandMs != 0 && millis() - lastCommandMs < COMMAND_COOLDOWN_MS) {
    sendJson(409, F("{\"ok\":false,\"error\":\"cooldown\"}"));
    return;
  }
  lastCommandMs = millis();
  startRelayPulse();
  sendJson(200, F("{\"ok\":true,\"message\":\"relay_pulse_started\"}"));
}

