lyq11/ESP32-Garage-Door-Control/firmware/c3_garage_node/c3_garage_node.ino
void handleWifiSave() {
  if (!requireAuth()) return;
  String ssid = bodyArg("ssid");
  String pass = bodyArg("pass");
  ssid.trim();
  if (!ssid.length()) {
    sendJson(400, F("{\"ok\":false,\"error\":\"ssid_required\"}"));
    return;
  }
  preferences.begin("wifi", false);
  preferences.putString("ssid", ssid);
  preferences.putString("pass", pass);
  preferences.end();
  sendJson(200, F("{\"ok\":true,\"message\":\"wifi_saved_rebooting\"}"));
  delay(500);
  ESP.restart();
}

void handleWifiClear() {
  if (!requireAuth()) return;
  preferences.begin("wifi", false);
  preferences.clear();
  preferences.end();
  sendJson(200, F("{\"ok\":true,\"message\":\"wifi_cleared_rebooting\"}"));
  delay(500);
  ESP.restart();
}

void handlePasswordSave() {
  if (!requireAuth()) return;
  String password = bodyArg("password");
  password.trim();
  if (password.length() < 6) {
    sendJson(400, F("{\"ok\":false,\"error\":\"password_too_short\"}"));
    return;
  }
  saveAdminPassword(password);
  sendJson(200, F("{\"ok\":true,\"message\":\"password_saved\"}"));
}

void handleSeqReset() {
  if (!requireAuth()) return;
  clearLastSeq("admin_web");
  sendJson(200, F("{\"ok\":true,\"message\":\"espnow_sequence_cleared\"}"));
}

void beginWeb() {
  server.on("/", HTTP_GET, handleIndex);
  server.on("/api/status", HTTP_GET, []() {
    if (!requireAuth()) return;
    sendJson(200, statusJson());
  });
  server.on("/api/config", HTTP_POST, handleConfig);
  server.on("/api/relay/test", HTTP_POST, handleRelayTest);
  server.on("/api/wifi/save", HTTP_POST, handleWifiSave);
  server.on("/api/wifi/clear", HTTP_POST, handleWifiClear);
  server.on("/api/auth/password", HTTP_POST, handlePasswordSave);
  server.on("/api/espnow/reset-seq", HTTP_POST, handleSeqReset);
  server.onNotFound([]() {
    if (server.method() == HTTP_OPTIONS) {
      sendJson(204, "");
    } else {
      if (!requireAuth()) return;
      sendJson(404, F("{\"ok\":false,\"error\":\"not_found\"}"));
    }
  });
  server.begin();
  logLine("http api ready");
}

void beginOta() {
  ArduinoOTA.setHostname(HOSTNAME);
  ArduinoOTA.setPassword(adminPassword.c_str());
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    esp_task_wdt_reset();
  });
  ArduinoOTA.begin();
  logLine("arduino OTA ready hostname=" + String(HOSTNAME));
}

void setup() {
  Serial.begin(115200);
  delay(300);
  Serial.println();
  logLine("boot");
  logLine("reset reason=" + String((int)esp_reset_reason()));
  logLine("mac=" + WiFi.macAddress());

  pinMode(RELAY_PIN, OUTPUT);
  relayOff();
  loadConfig();
  connectWifiOrStartAp();
  resolveEspNowChannel();
  beginEspNow();
  beginWeb();
  beginOta();
  enableLoopWDT();
  logLine("loop watchdog enabled timeout=5s");
}

void loop() {
  maintainWifi();
  processEspNowQueue();
  server.handleClient();
  ArduinoOTA.handle();
  if (relayActive && millis() - relayPulseStartMs >= relayPulseMs) {
    relayOff();
  }
}
